In [95]:
print('alo mundo')

alo mundo

In [96]:
! pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\ead\desktop\guido\projetofinal_tarde\.venv\lib\site-packages (2.0.31)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\ead\desktop\guido\projetofinal_tarde\.venv\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\ead\desktop\guido\projetofinal_tarde\.venv\lib\site-packages (from sqlalchemy) (3.0.3)

In [97]:
import pandas as pd

In [98]:
# Módulo

from sqlalchemy import create_engine

In [99]:
! pip install pymysql

Requirement already satisfied: pymysql in c:\users\ead\desktop\guido\projetofinal_tarde\.venv\lib\site-packages (1.1.1)

In [100]:
import pymysql

In [101]:
import urllib.parse

In [102]:
# Dfinir as credenciais
user = 'root'
password = urllib.parse.quote_plus('senai@123')
host = 'localhost'
database = 'schooltracker'

# Criar uma url de conexão
connection_string = f'mysql+pymysql://{user}:{password}@{host}/{database}'

# criar uma conexão com o create_engine()
engine = create_engine(connection_string)

# Escrever uma consulta SQL
query_alunos = 'SELECT * FROM aluno'

# Criar o DataFrame
df_alunos = pd.read_sql(query_alunos,engine)

# Mostra os cinco primeiros
df_alunos.head()

   id        ra  nome  tempoestudo  renda_media_mensal_familiar
0   1  00034547  None          NaN                          NaN
1   2  00034548  None          NaN                          NaN
2   3  00034549  None          NaN                          NaN
3   4  00034550  None          NaN                          NaN
4   5  00034551  None          NaN                          NaN

# Quais bibliotecas um cientista de dados utiliza

Pandas
Numpy
Scikit-Learn (fundamentos de IA)

## Material Didático

Notebook (pandas, numpy)
Apostila senai (scikit-learn)

# Carregar dados

# Salvar um DataFrame

In [103]:
csv_filename = 'alunos.csv'
df_alunos.to_csv(csv_filename, index=False)

# Exercício -Salve o DataFrame no formato Json

In [104]:
csv_filename = 'alunos.json'
df_alunos.to_json(csv_filename, index=False)

In [105]:
! pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\ead\desktop\guido\projetofinal_tarde\.venv\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\ead\desktop\guido\projetofinal_tarde\.venv\lib\site-packages (from openpyxl) (1.1.0)

# Um novo DataFrame

In [106]:
csv_filename = 'planilha_alunos.xlsx'
df_alunos.to_excel(csv_filename, index=False)

In [107]:
df_alunos.columns

Index(['id', 'ra', 'nome', 'tempoestudo', 'renda_media_mensal_familiar'], dtype='object')

In [108]:
df_tempo_renda = df_alunos[['tempoestudo','renda_media_mensal_familiar']]
df_tempo_renda

     tempoestudo  renda_media_mensal_familiar
0            NaN                          NaN
1            NaN                          NaN
2            NaN                          NaN
3            NaN                          NaN
4            NaN                          NaN
..           ...                          ...
100         21.0                       3000.0
101         17.0                       3100.0
102         25.0                       3400.0
103         12.0                       3200.0
104         20.0                       2900.0

[105 rows x 2 columns]

# Exercício 2 - Crie um recurso para mostrar apenas o tipo desse recurso

In [109]:
type(df_tempo_renda)

pandas.core.frame.DataFrame

In [110]:
df_tempo_renda.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105 entries, 0 to 104
Data columns (total 2 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   tempoestudo                  50 non-null     float64
 1   renda_media_mensal_familiar  50 non-null     float64
dtypes: float64(2)
memory usage: 1.8 KB

In [111]:
df_tempo_renda.shape

(105, 2)

In [112]:
df_tempo_renda['tempoestudo']

0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
       ...
100    21.0
101    17.0
102    25.0
103    12.0
104    20.0
Name: tempoestudo, Length: 105, dtype: float64

In [113]:
serie_tempo_renda = df_tempo_renda['tempoestudo']

In [114]:
type(serie_tempo_renda)

pandas.core.series.Series

# Revisando Funções Básicas

2024/08/06

# Exercício 01: Retorne o DataFrame da última aula com as duas primeiras linhas como amostras.

In [115]:
ex1 = df_alunos.head(2)

ex1

   id        ra  nome  tempoestudo  renda_media_mensal_familiar
0   1  00034547  None          NaN                          NaN
1   2  00034548  None          NaN                          NaN

# Exercício 02: Retorne as duas últimas linhas da amostra

In [116]:
ex2 = df_alunos.tail(2)

ex2

      id        ra            nome  tempoestudo  renda_media_mensal_familiar
103  104  00034648   Rogério Silva         12.0                       3200.0
104  105  00034649  Amanda Pereira         20.0                       2900.0

# Exercício 03: Retorne uma tupla com o número de linhas e colunas

In [117]:
df_alunos.shape

(105, 5)

# Exercício 04: Retorne as informações gerais do DataFrame

In [118]:
df_alunos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105 entries, 0 to 104
Data columns (total 5 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   id                           105 non-null    int64
 1   ra                           105 non-null    object
 2   nome                         50 non-null     object
 3   tempoestudo                  50 non-null     float64
 4   renda_media_mensal_familiar  50 non-null     float64
dtypes: float64(2), int64(1), object(2)
memory usage: 4.2+ KB

# Exercício 05: Retorne as colunas

In [119]:
df_alunos.columns

Index(['id', 'ra', 'nome', 'tempoestudo', 'renda_media_mensal_familiar'], dtype='object')

# Exercício 06: Retorne as informações apenas da coluna renda famiiar

In [120]:
df_alunos['renda_media_mensal_familiar'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 105 entries, 0 to 104
Series name: renda_media_mensal_familiar
Non-Null Count  Dtype
--------------  -----
50 non-null     float64
dtypes: float64(1)
memory usage: 972.0 bytes

# Exercício 07: Mostre os tipos com dtypes

In [121]:
df_alunos.dtypes

id                               int64
ra                              object
nome                            object
tempoestudo                    float64
renda_media_mensal_familiar    float64
dtype: object

# Exercício 08: 
# Crie um dataframe da tabela diário de bordo

In [122]:


# Escrever uma consulta SQL
query_diariobordo = 'SELECT * FROM diariobordo'

# Criar o DataFrame
df_diariobordo = pd.read_sql(query_diariobordo,engine)

df_diariobordo.head()

   id      texto            datahora  fk_aluno_id
0   1  aulatarde 2024-07-31 15:54:02           40
1   2  crieiumbd 2024-07-31 17:53:12            2

# Retorne uma tupla com o número de linhas e colunas

In [123]:
df_diariobordo.shape

(2, 4)

# Mostre os tipos com dtypes

In [124]:
df_diariobordo.dtypes

id                      int64
texto                  object
datahora       datetime64[ns]
fk_aluno_id             int64
dtype: object

# Retorne as informações gerais do DataFrame

In [125]:
df_diariobordo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           2 non-null      int64
 1   texto        2 non-null      object
 2   datahora     2 non-null      datetime64[ns]
 3   fk_aluno_id  2 non-null      int64
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 196.0+ bytes

# Exercício 09: 

# Crie um dataframe da tabela avaliaçâo

In [126]:
query_avaliacao = 'SELECT * FROM avaliacao'
df_avaliacao = pd.read_sql(query_avaliacao,engine)

# Retorne o DataFrame da última aula com as cinco primeiras linhas como amostras.

In [127]:
cincoprimeiras = df_avaliacao.head(2)

cincoprimeiras

   id_pk  nota1  nota2  nota3  nota4  fk_aluno_id
0      1     15     20     18     23           35
1      2     12     21     19     24           36

# Retorne as duas últimas linhas da amostra

In [128]:
ultimaslinhas = df_avaliacao.tail(2)
ultimaslinhas

   id_pk  nota1  nota2  nota3  nota4  fk_aluno_id
3      4     16     20     21     23           38
4      5     25     19     22     25           39

# Retorne as colunas

In [129]:
df_avaliacao.columns

Index(['id_pk', 'nota1', 'nota2', 'nota3', 'nota4', 'fk_aluno_id'], dtype='object')

# Retorne as informações apenas da coluna nota3

In [130]:
df_avaliacao['nota3'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 5 entries, 0 to 4
Series name: nota3
Non-Null Count  Dtype
--------------  -----
5 non-null      int64
dtypes: int64(1)
memory usage: 172.0 bytes

# Realizando um JOIN

## Passos para o merge
- Use o comando merge
- Crie uma variável: resultado
- pd.merge(dataframe1, dataframe2, tipo_uniao, qual chave da direita, qual chave da esquerda)
- Qual o tipo de união: how = 'inner'
- inner significa queremos um join interno, o que resulta em apenas linhas que tem correspondencia em ambos os dataframes.

Crie uma junção do dataframe aluno com avaliacao. Mostre as nota do aluno e a Ra do aluno

In [140]:


# Realizar um inner join com base na coluna 'ID'
resultado2 = pd.merge(df_avaliacao, df_alunos, how ='left', left_on = 'fk_aluno_id', right_on = 'id')
# Selecionar as colunas desejadas
resultado_selecionado2 = resultado2[['ra','nota1','nota2','nota3','nota4']]
# Mostrar o resultado
resultado_selecionado2.head()

         ra  nota1  nota2  nota3  nota4
0  00034581     15     20     18     23
1  00034582     12     21     19     24
2  00034583     19     22     17     25
3  00034584     16     20     21     23
4  00034585     25     19     22     25